# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep' # Plain-text data regexp search
brew 'httpie' # CLI HTTP commands
brew 'mackup' # Backup configs
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Zsh Plugins
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# Development
brew 'node'
brew 'yarn'

# Apps
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'slack'
cask 'sublime-text'
cask 'there'
cask 'the-unarchiver'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Things', id: 904280696
mas '1Password' id:443987910