# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg' # Record, convert, and stream audio and video
brew 'git'
brew 'grep' # Plain-text data regexp search
brew 'httpie' # CLI HTTP commands
brew 'mackup' # Backup configs
brew 'mas' # Mac App Store manager
brew 'svn' # 
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'mysql'
# brew 'nginx'
brew 'node'
# brew 'redis'
brew 'yarn'

# Zsh Plugins
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# Apps
cask '1password'
cask 'caffeine'
cask 'dbngin' # Database version management tool
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'gitkraken'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite' # Email and messaging encryption
cask 'imageoptim' # Optimize images for the web
cask 'insomnia' # API dedsign platform
cask 'iterm2'
# cask 'pastebot' # Clipboard history for easily accessing everything copied (trial)
cask 'postman'
# cask 'ray' # Dump debugging (like mistake.io, quokka, browser console)
# cask 'screenflow' # Video editting app
# cask 'signal' # Private encrypted digital messaging
cask 'slack'
cask 'sublime-text'
cask 'spectacle' # Keyboard window management
cask 'spotify'
cask 'tableplus' # Database management tool
# cask 'telegram-desktop' # iMessage alternative
cask 'the-unarchiver'
# cask 'transmit' # macOS gold standard file transfer
# cask 'tunnelbear' # public VPN service
# cask 'tuple' # Pair programming (trial)
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'

# Mac App Store
mas 'Giphy Capture', id: 668208984 # GIF-maker
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641 # Alternate powerful team-based email client
mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696 # Powerful todo app (paid)
# mas 'Tweetbot', id: 1384080005 # Twitter management on steroids (paid)